Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Every query operation accepts passing parameters by index (`Object...`), or by name (`Map<String,Object>`).
ja_jp: すべてのクエリー操作は、インデックス (`Object...`) または名前 (`Map<String,Object>`) でパラメーターを渡すことができます。

source: Every time you will need the indentation to be respected in the Javadoc comment (think list items spread on multiple lines or indented source code), you will need to disable temporarily the automatic Eclipse formatter (this, even if you don't use Eclipse as the formatter is included in our build). To do so, use the `// @formatter:off`/`// @formatter:on` markers. Note the fact that they are separate comments and there is a space after the `//` marker. This is required.
ja_jp: Javadocのコメントでインデントを尊重する必要がある場合（複数行にまたがるリスト項目やインデントされたソースコードを考えてみてください）には、Eclipseの自動フォーマッタを一時的に無効にする必要があります（これはEclipseを使用していない場合でも同様です。私たちのビルドにはフォーマッタが含まれている為です）。これを行うには、 `// @formatter:off` / `// @formatter:on` マーカーを使用してください。これらは別々のコメントであり、 `//` マーカーの後にスペースがあることに注意してください。これは必須です。

source: Everything but Vert.x
ja_jp: Vert.x以外はすべて

source: Everything but Vert.x and the HTTP server
ja_jp: Vert.xとHTTPサーバー以外はすべて

source: Everything described here will only work in the context of Quarkus extensions, it won't work in an application.
ja_jp: ここで説明したことはすべて、Quarkus エクステンションの文脈でのみ機能し、アプリケーションでは機能しません。

source: Everything related to native executables
ja_jp: ネイティブ実行可能ファイルに関する全て

source: Everything that can be covered by a provider declaration such as `quarkus.oidc.provider=github` can be directly supported by individual configuration properties. Each property set internally by the `quarkus.oidc.provider` declarations can be overridden, for example, see the xref:security-openid-connect-providers.adoc#provider-scope[Provider scopes] section.
ja_jp: `quarkus.oidc.provider=github` のようなプロバイダー宣言でカバーできるものはすべて、個別の設定プロパティーによって直接サポートできます。 `quarkus.oidc.provider` 宣言によって内部的に設定された各プロパティーは上書き可能です。たとえば、 xref:security-openid-connect-providers.adoc#provider-scope[プロバイダーのスコープ] セクションを参照してください。

source: Everything under the `"%test"` key is only enabled when the `test` profile is active. For example, in the previous snippet it disables OIDC (`quarkus.oidc.enabled: false`), whereas without the `test` profile, it would be enabled.
ja_jp: `"%test"` キーの下にあるすべてのものは、 `test` プロファイルがアクティブな場合にのみ有効です。例えば、前述のスニペットでは、OIDC ( `quarkus.oidc.enabled: false`) を無効にしていますが、 `test` プロファイルがなければ、有効になります。

source: Everything you need to know about it is detailed in the link:/guides/deploying-to-kubernetes#service-binding[Kubernetes guide].
ja_jp: そのために必要なことはすべて、 link:/guides/deploying-to-kubernetes#service-binding[Kubernetesガイド]に詳しく書かれています。

source: Exact redirect URI match
ja_jp: リダイレクト URI の完全一致

source: Exactly the same configuration can be used to override a discovered endpoint URL if that URL does not work for the local Quarkus endpoint and a more specific value is required. For example, one can imagine that in the above example, a provider which supports both global and application specific end-session endpoints returns a global end-session URL such as `http://localhost:8180/oidcprovider/account/global-logout` which will logout the user from all the applications this user is currently logged in, while the current application only wants to get this user logged out from this application, therefore, `quarkus.oidc.end-session-path=logout` is used to override the global end-session URL.
ja_jp: 検出されたエンドポイントURLがローカルのQuarkusエンドポイントで機能せず、より具体的な値が必要な場合、まったく同じ設定を使用して上書きすることができます。例えば、上記の例で、グローバルエンドセッションとアプリケーション固有のエンドポイントの両方をサポートするプロバイダが、グローバルエンドセッションURL（ `http://localhost:8180/oidcprovider/account/global-logout` など）を返すと、このユーザーが現在ログインしているすべてのアプリケーションからユーザーがログアウトしますが、現在のアプリケーションはこのアプリケーションからユーザーのログアウトを取得したいだけだと想像できます。したがって、グローバルエンドセッションURLをオーバーライドするには `quarkus.oidc.end-session-path=logout` が使用されます。

source: Exactly-Once Processing
ja_jp: Exactly-Once 処理

source: Examine sam.yaml
ja_jp: sam.yaml を調べる

source: Examine the JAX-RS resource
ja_jp: JAX-RSのリソース調査

source: Examine the Jakarta REST resource
ja_jp: Jakarta REST リソースの調査

source: Examine the POM
ja_jp: POM を検証する

source: Examine the POM and Gradle build
ja_jp: POM と Gradle のビルドの検証

source: Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your functions.
ja_jp: 関数を作成、削除、更新するためにどのようなawsコマンドが実行されるかを知りたい場合は、 `manage.sh` スクリプトの出力を調べてください。

source: Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your lambdas.
ja_jp: Lambda を作成、削除、更新するためにどのようなawsコマンドが実行されるかを知りたい場合は、 `manage.sh` スクリプトの出力を調べてください。

source: Examining the project
ja_jp: プロジェクトの確認

source: Example
ja_jp: 例

source: Example (Agroal):
ja_jp: 例 (Agroal):

source: Example 1 - Name mismatch
ja_jp: 例 1 - 名前の不一致

source: Example 2: Application of a custom name for a datasource
ja_jp: 例 2: データソースのカスタム名のアプリケーション

source: Example CLI command: `quarkus create app -x smallrye-health --code --java -P=io.quarkus:quarkus-bom:999-SNAPSHOT`
ja_jp: CLIコマンドの例： `quarkus create app -x smallrye-health --code --java -P=io.quarkus:quarkus-bom:999-SNAPSHOT`

source: Example CORS configuration
ja_jp: CORS 設定の例

source: Example Configuration
ja_jp: 設定例

source: Example CriteriaBuilderConfiguration and EntityViewConfiguration observing
ja_jp: 観測する CriteriaBuilderConfiguration と EntityViewConfiguration の例

source: Example Entity
ja_jp: エンティティーの例

source: Example Entity-View
ja_jp: エンティティービューの例

source: Example Gradle dependencies:
ja_jp: Gradleの依存関係の例。

source: Example HttpUpgradeCheck
ja_jp: HttpUpgradeCheck の例

source: Example JAX-RS Resource
ja_jp: JAX-RSリソースの例

source: Example JWK
ja_jp: JWK の例

source: Example JWK Set
ja_jp: JWK セットの例

source: Example Jakarta Data repository with class-level security annotation
ja_jp: クラスレベルのセキュリティーアノテーションを使用した Jakarta Data リポジトリーの例

source: Example Jakarta Data repository with method-level security annotation
ja_jp: メソッドレベルのセキュリティーアノテーションを使用した Jakarta Data リポジトリーの例

source: Example Jakarta REST Resource
ja_jp: Jakarta REST リソースの例

source: Example Jandex Usage
ja_jp: Jandex の使用例

source: Example KeyStoreProvider
ja_jp: KeyStoreProvider の例

source: Example Passwords
ja_jp: パスワードの例

source: Example Roles
ja_jp: ロールの例

source: Example Security Providers BouncyCastle Configuration
ja_jp: セキュリティープロバイダの例 BouncyCastleの設定

source: Example Security Providers BouncyCastle FIPS Configuration
ja_jp: BouncyCastle FIPS セキュリティープロバイダの設定例

source: Example Security Providers BouncyCastle FIPS JSSE Configuration
ja_jp: BouncyCastle FIPS JSSE セキュリティープロバイダの設定例

source: Example Security Providers BouncyCastle JSSE Configuration
ja_jp: BouncyCastle JSSE セキュリティープロバイダの設定例

source: Example Security Providers Configuration
ja_jp: セキュリティー プロバイダの設定例

source: Example Startup Lines
ja_jp: 起動時の行の例

source: Example TLS configuration
ja_jp: TLS 設定の例

source: Example TrustStoreProvider
ja_jp: TrustStoreProvider の例

source: Example WebSocket endpoint with secured HTTP upgrade
ja_jp: セキュアな HTTP アップグレードを備えた WebSocket エンドポイントの例

source: Example YAML configurations
ja_jp: YAML 設定例

source: Example `application.properties`
ja_jp: `application.properties` の例

source: Example `{config-file}`
ja_jp: 例: `{config-file}`

source: Example analytics payload
ja_jp: 分析ペイロードの例

source: Example application
ja_jp: アプリケーション例

source: Example application bean using Hibernate
ja_jp: Hibernateを使用したアプリケーションBeanの例

source: Example application bean using Hibernate Reactive
ja_jp: Hibernate Reactiveを使用したアプリケーションBeanの例

source: Example application.properties
ja_jp: application.properties の例

source: Example configuration
ja_jp: 設定例

source: Example configuration for a SmallRye GraphQL client:
ja_jp: SmallRye GraphQL クライアントの設定例:

source: Example configuration for a gRPC client:
ja_jp: gRPC クライアントの設定例:

source: Example configuration for the core HTTP server:
ja_jp: コア HTTP サーバーの設定例:

source: Example configuration:
ja_jp: 設定例:

source: Example custom `HttpSecurityPolicy`
ja_jp: カスタム `HttpSecurityPolicy` の例

source: Example dependencies using Maven
ja_jp: Mavenを使った依存関係の例

source: Example entry:
ja_jp: エントリ例:

source: Example how JWT Bearer token can be used to authenticate client
ja_jp: JWT ベアラートークンを使用したクライアント認証方法の例

source: Example mutual TLS client authentication configuration
ja_jp: 相互 TLS クライアント認証設定の例

source: Example of `client_secret_basic`:
ja_jp: `client_secret_basic` の例:

source: Example of Basic authentication properties
ja_jp: Basic認証の有効化

source: Example of Configuration
ja_jp: 構成の例

source: Example of Producing a ServiceStartBuildItem
ja_jp: ServiceStartBuildItem の生成例

source: Example of `client_secret_jwt`, where the secret is retrieved from a xref:credentials-provider.adoc[credentials provider]:
ja_jp: `client_secret_jwt` の例。この場合、シークレットは xref:credentials-provider.adoc[クレデンシャルプロバイダー] から取得されます。

source: Example of `client_secret_jwt`, where the signature algorithm is HS256:
ja_jp: `client_secret_jwt` の例。署名アルゴリズムは HS256:

source: Example of `client_secret_post`
ja_jp: `client_secret_post` の例

source: Example of `private_key_jwt` with the PEM key file, and where the signature algorithm is RS256:
ja_jp: PEM 鍵ファイルを使用した `private_key_jwt` の例。署名アルゴリズムは RS256:

source: Example of `private_key_jwt` with the PEM key inlined in application.properties, and where the signature algorithm is `RS256`:
ja_jp: PEM キーが application.properties にインライン化され、署名アルゴリズムが `RS256` である `private_key_jwt` の例:

source: Example of `private_key_jwt` with the keystore file, where the signature algorithm is RS256:
ja_jp: keystoreファイルによる `private_key_jwt` の例。署名アルゴリズムはRS256:

source: Example of `test-roles.properties`
ja_jp: `test-roles.properties` の例

source: Example of `test-users.properties`
ja_jp: `test-users.properties` の例

source: Example of a WebSocket endpoint with secured HTTP upgrade
ja_jp: セキュアな HTTP アップグレードを備えた WebSocket エンドポイントの例

source: Example of a custom `java.security.Permission` class that accepts additional arguments
ja_jp: 追加の引数を受け入れるカスタムの `java.security.Permission` クラスの例

source: Example of a multiple build item
ja_jp: マルチビルドアイテムの例

source: Example of a permission checker authorizing the HTTP upgrade
ja_jp: HTTP アップグレードを承認する権限チェッカーの例

source: Example of a property expressions usage in the `@RolesAllowed` annotation
ja_jp: `@RolesAllowed` アノテーションにおけるプロパティ式の使用例

source: Example of a resource secured with the `LibraryPermission`
ja_jp: `LibraryPermission` で保護されたリソースの例

source: Example of a role-based policy
ja_jp: ロールベースポリシーの例

source: Example of a single build item
ja_jp: 単一のビルドアイテムの例

source: Example of a test executed in JVM mode:
ja_jp: JVM モードで実行されるテストの例:

source: Example of a test executed in native mode:
ja_jp: ネイティブモードで実行されるテストの例:

source: Example of adding the `LibraryPermission` programmatically to `SecurityIdentity`
ja_jp: プログラムで `SecurityIdentity` に `LibraryPermission` を追加する例

source: Example of an Entity
ja_jp: エンティティの例

source: Example of an empty build item
ja_jp: 空のビルドアイテムの例

source: Example of build step that is always executed in a "pseudo-target" style
ja_jp: 「疑似ターゲット」スタイルで常に実行されるビルドステップの例

source: Example of custom `GrpcSecurityMechanism`
ja_jp: カスタム `GrpcSecurityMechanism` の例

source: Example of custom named HttpSecurityPolicy applied on every HTTP request
ja_jp: すべての HTTP リクエストに適用されるカスタム名の HttpSecurityPolicy の例

source: Example of custom named HttpSecurityPolicy bound to a Jakarta REST endpoint
ja_jp: Jakarta REST エンドポイントにバインドされたカスタム名の HttpSecurityPolicy の例

source: Example of custom named HttpSecurityPolicy referenced from configuration file
ja_jp: 設定ファイルから参照されるカスタム名の HttpSecurityPolicy の例

source: Example of endpoints secured with the `@PermissionsAllowed` annotation
ja_jp: `@PermissionsAllowed` アノテーションで保護されたエンドポイントの例

source: Example of mapping volumes to persist the database data
ja_jp: データベースデータを永続化するためのマッピングボリュームの例

source: Example of multiple build item usage
ja_jp: マルチビルドアイテムの使用例

source: Example of passwords
ja_jp: パスワードの例

source: Example of policy configuration
ja_jp: ポリシーの設定例

source: Example of producing a build item weakly
ja_jp: ビルドアイテムの弱い生成例

source: Example of roles
ja_jp: ロールの例

source: Example of signature
ja_jp: シグネチャーの例

source: Example of the HTTP Authentication mechanisms check
ja_jp: HTTP 認証メカニズムの確認の例

source: Example of the Message Bundle Interface with a default value
ja_jp: デフォルト値があるメッセージバンドルインターフェイスの例

source: Example of the Message Bundle Interface without the value
ja_jp: 値のない Message Bundle Interface の例

source: Example of the `application.properties` file section for embedded realm
ja_jp: 組込レルム用 `application.properties` ファイル部の例

source: Example of the `application.properties` file section for property files realm
ja_jp: プロパティファイルレルム用の `application.properties` ファイルセクションの例

source: Example of the role mapping file
ja_jp: ロールマッピングファイルの例

source: Example of usage
ja_jp: 使用例

source: Example of usage of an empty build item in a "barrier" style
ja_jp: 空のビルドアイテムを "バリア " スタイルで使用した例

source: Example of usage of an empty build item in a "pseudo-target" style
ja_jp: 空のビルドアイテムを「疑似ターゲット」スタイルで使用する例

source: Example of usage of an validation error build item in a "pseudo-target" style
ja_jp: 「疑似ターゲット」スタイルでバリデーションエラービルドアイテムを使用する例

source: Example of using a bytecode recorder where the generated class is weakly produced
ja_jp: 生成されたクラスが弱く生成されるバイトコードレコーダーの使用例

source: Example persistence.xml resource
ja_jp: persistence.xml リソースの例

source: Example pull request
ja_jp: プルリクエストの例

source: Example repository with a generic method using a type variable
ja_jp: 型変数を使用した汎用メソッドを持つリポジトリーの例

source: Example response
ja_jp: 応答の例

source: Example response, the order is non-deterministic.
ja_jp: 応答例、順序は非決定的です。

source: Example scheduled task with `@RunAsUser`
ja_jp: `@RunAsUser` を使用したスケジュールタスクの例

source: Example server configuration
ja_jp: サーバー設定の例

source: Example src/main/jib/home/jboss/run-java.sh
ja_jp: 例 src/main/jib/home/jboss/run-java.sh

source: Example updatable Entity-View
ja_jp: 更新可能なEntity-Viewの例

source: Example usage:
ja_jp: 使用例:

source: Example using maven
ja_jp: mavenを使用した例

source: Example using the Reactive Messaging Kafka extension
ja_jp: Reactive Messaging Kafka エクステンションの使用例

source: Example using the `switch`/`case` name aliases
ja_jp: `switch` / `case` の名前エイリアスを使用した例

source: Example using the `when`/`is` name aliases
ja_jp: `when` / `is` の名前のエイリアスを使用した例

source: Example values
ja_jp: 値の例

source: Example with JBoss Logging and `io.quarkus.logging.Log`
ja_jp: JBossロギングと `io.quarkus.logging.Log` の例

source: Example. Assuming you have the following pipeline:
ja_jp: 例えば、次のようなパイプラインがあるとします:

source: Example:
ja_jp: 例:

source: Example: Log in by using the OpenShift CLI
ja_jp: 例: OpenShift CLIを使用してログインします。

source: Example: Log in by using the OpenShift CLI with API token
ja_jp: 例: API トークンと OpenShift CLI を使用してログインします。

source: Example: Using a JWT Bearer token to authenticate a client
ja_jp: 例: JWT ベアラートークンを使用してクライアントを認証する

source: Example: We want to know when new Heroes are being created:
ja_jp: 例: 新しいヒーローが作成されるタイミングを知りたい。

source: Examples
ja_jp: 例

source: Examples of logging configurations
ja_jp: ロギング設定の例

source: Examples of such finds are https://camel.apache.org/blog/2021/12/log4j2/[Camel NSQ, Camel Corda] and https://vertx.io/blog/CVE-2021-44228/[Vert.x] which in their transitive dependencies include a log4j-core.jar but it is never used nor in any form activated when using Quarkus.
ja_jp: このような発見の例として、link:https://camel.apache.org/blog/2021/12/log4j2/[Camel NSQ、Camel Corda] 、link:https://vertx.io/blog/CVE-2021-44228/[Vert.x]があり、 これらの依存関係にはlog4j-core.jarが含まれていますが、Quarkusを使用する際には決して使われず、いかなる形でも有効にはなりません。

source: Examples of this use case are:
ja_jp: このユースケースの例は次のとおりです:

source: Examples:
ja_jp: 例:

source: Excellent, we have not provided any JWT in the request, so we should not be able to access the endpoint, and we were not. Instead we received an HTTP 401 Unauthorized error. We need to obtain and pass in a valid JWT to access that endpoint. There are two steps to this, 1) configuring our {extension-name} extension with information on how to validate a JWT, and 2) generating a matching JWT with the appropriate claims.
ja_jp: 素晴らしいですね。リクエストに JWT トークンを提供していないため、エンドポイントにはアクセスできないはずであり、実際にアクセスできませんでした。代わりに HTTP 401 Unauthorized エラーを受け取りました。エンドポイントにアクセスするためには、有効な JWT を取得して渡す必要があります。これには 2 つのステップがあります。1) {extension-name} エクステンションに JWT の検証方法に関する情報を設定し、2) 適切なクレームを持つ適合する JWT を生成します。

source: Excellent, we have not provided any JWT in the request, so we should not be able to access the endpoint, and we were not. Instead, we received an HTTP 401 Unauthorized error. We need to obtain and pass in a valid JWT to access that endpoint. There are two steps to this, 1) configuring our {extension-name} extension with information on how to validate a JWT, and 2) generating a matching JWT with the appropriate claims.
ja_jp: 素晴らしいですね。リクエストに JWT トークンを提供していないため、エンドポイントにはアクセスできないはずであり、実際にアクセスできませんでした。代わりに HTTP 401 Unauthorized エラーを受け取りました。エンドポイントにアクセスするためには、有効な JWT を取得して渡す必要があります。これには 2 つのステップがあります。1) {extension-name} エクステンションに JWT の検証方法に関する情報を設定し、2) 適切なクレームを持つ適合する JWT を生成します。

source: Excellent, we have not provided any OAuth2 token in the request, so we should not be able to access the endpoint, and we were not. Instead we received an HTTP 401 Unauthorized error. We need to obtain and pass in a valid OAuth2 token to access that endpoint. There are two steps to this, 1) configuring our {extension-name} extension with information on how to validate the token, and 2) generating a matching token with the appropriate claims.
ja_jp: 素晴らしい、リクエストにOAuth2トークンを提供していないので、エンドポイントにアクセスできないはずであり、アクセス出来ませんでした。代わりにHTTP 401 Unauthorizedエラーを受け取りました。エンドポイントにアクセスするためには、有効な OAuth2 トークンを取得して渡す必要があります。これには 2 つのステップがあります。1) {extension-name} エクステンションにトークンの検証方法に関する情報を設定すること、そして 2) 適切なクレームを持つ適合するトークンを生成することです。

source: Excellent, we have not provided any OAuth2 token in the request, so we should not be able to access the endpoint, and we were not. Instead, we received an HTTP 401 Unauthorized error. We need to obtain and pass in a valid OAuth2 token to access that endpoint. There are two steps to this, 1) configuring our {extension-name} extension with information on how to validate the token, and 2) generating a matching token with the appropriate claims.
ja_jp: 素晴らしいことに、リクエストでOAuth2トークンを提供していないので、エンドポイントにアクセスできないはずですが、そうではありませんでした。代わりに、HTTP 401 Unauthorized エラーが発生しました。エンドポイントにアクセスするためには、有効な OAuth2 トークンを取得して渡す必要があります。1) {extension-name} エクステンションにトークンの検証方法を設定する、2) 適切なクレームを含む一致するトークンを生成する。

source: Excellent. You did not provide a JWT in the request, so access to the endpoint was correctly denied. Instead, you received an HTTP 401 Unauthorized error.
ja_jp: リクエストに JWT が指定されなかったため、エンドポイントへのアクセスが正しく拒否されました。 代わりに、HTTP 401 Unauthorized エラーが表示されました。

source: Except in very specific situations, it is recommended to make the said beans `@ApplicationScoped`.
ja_jp: 非常に特定の状況を除いて、このBeanは `@ApplicationScoped` として作ることをお勧めします.

source: Except when an extension actually requires it to function properly, we are now disabling JNDI by default.
ja_jp: エクステンションが正常に動作するためにJNDIを必要とする場合を除き、現在はデフォルトでJNDIを無効にしています。

source: Exception Help in the Log
ja_jp: ログ内の例外ヘルプ

source: Exception handler method parameter types
ja_jp: 例外ハンドラーメソッドのパラメーターの型

source: Exception handler method return types
ja_jp: 例外ハンドラーメソッドの戻り値の型

source: Exception handling
ja_jp: 例外処理

source: Exception help
ja_jp: 例外ヘルプ

source: Exception mapper parameters
ja_jp: 例外マッパーパラメーター

source: Exception mapper return types
ja_jp: 例外マッパーの戻り値の型

source: Exception mapping
ja_jp: 例外のマッピング

source: Exceptions Thrown By An Asynchronous Observer Method
ja_jp: 非同期オブザーバーメソッドによって出力される例外

source: Exceptions may bubble up
ja_jp: 例外がバブルアップする場合がある

source: Exchange Token Before Propagation
ja_jp: 伝搬前のトークンの交換

source: Exchange token before propagation
ja_jp: 伝播前にトークンを交換する

source: Exclude all classes in `org/example/package` package
ja_jp: `org/example/package` パッケージに含まれるすべてのクラスを除外します

source: Exclude all types from the `org.acme` package.
ja_jp: `org.acme` パッケージからすべてのタイプを除外します。

source: Exclude all types whose simple name is `Bar`
ja_jp: シンプルな名前が `Bar` であるすべてのタイプを除外します。

source: Exclude the type `org.acme.Foo`.
ja_jp: タイプ `org.acme.Foo` を除外します。

source: Excluding classes from the verification task can be configured as following:
ja_jp: 検証タスクからクラスを除外するには、以下のように設定します:

source: Excluding tests when running as a native executable
ja_jp: ネイティブ実行可能ファイルとして実行している場合のテストの除外

source: Exclusions are also possible using `quarkus.smallrye-openapi.<document-name>.scan-exclude-profiles`.
ja_jp: `quarkus.smallrye-openapi.<document-name>.scan-exclude-profiles` を使用して除外することも可能です。

source: Executable built that way with the container runtime will be a 64-bit Linux executable, so depending on your operating system it may no longer be runnable.
ja_jp: コンテナ・ランタイムを使用してこの方法でビルドされた実行可能ファイルは、64ビットLinux実行可能ファイルとなるため、オペレーティング・システムによっては実行できなくなる可能性があります。

source: Executable built that way with the container runtime will be a 64-bit Linux executable, so depending on your operating system, it may no longer be runnable.
ja_jp: コンテナーランタイムを使用してそのようにビルドされた実行ファイルは 64 ビット Linux 実行ファイルになるため、お使いのオペレーティングシステムによっては実行できなくなる可能性があります。

source: Execute Funqy HTTP functions
ja_jp: Funqy HTTP Function の実行

source: Execute `./mvnw -DquicklyDocs`
ja_jp: `./mvnw -DquicklyDocs` の実行

source: Execute custom commands
ja_jp: カスタムコマンドの実行

source: Execute the query and block while waiting for the response. There is also an asynchronous variant that returns a `Uni<Response>`.
ja_jp: クエリを実行し、応答を待つ間にブロックします。また、 `Uni<Response>` を返す非同期型もあります．

source: Execute: gradle wrapper to set up the gradle wrapper (recommended).
ja_jp: Execute: gradle wrapper を実行して gradle wrapper を設定します (推奨)。

source: Execute: gradle wrapper to setup the gradle wrapper (recommended).
ja_jp: Execute: gradle wrapper を実行して gradle wrapper を設定します(推奨)。

source: Executes token verification and converts the token to a `SecurityIdentity`.
ja_jp: トークンの検証を実行し、トークンを `SecurityIdentity` に変換します。

source: Executing Asynchronous Code From a Blocking Thread
ja_jp: ブロッキングスレッドから非同期コードを実行

source: Executing `./mvnw quarkus:dependency-tree` on your project should result in an output similar to:
ja_jp: プロジェクトで `./mvnw quarkus:dependency-tree` を実行すると、次のような出力が得られるはずです。

source: Executing a long-running task might yield a warning message similar to the following:
ja_jp: 長時間実行されるタスクを実行すると、次のような警告メッセージが表示されることがあります：

source: Executing against a running application
ja_jp: 実行中のアプリケーションに対するテストの実行

source: Executing certain commands modifies the server-side state and the behavior of the connection. Such connections cannot be reused and when closed, they are not put back into the pool; instead, they are truly closed. The commands that cause this behavior are:
ja_jp: 特定のコマンドを実行すると、サーバー側の状態と接続の動作が変更されます。 このような接続は再利用できず、切断されたときにプールに戻されるのではなく、完全に切断されます。 この動作を行うコマンドは次のとおりです。

source: Executing custom commands
ja_jp: カスタムコマンドの実行

source: Executing route on a virtual thread
ja_jp: 仮想スレッドでのルートの実行

source: Executing some method against the deployment classpath
ja_jp: デプロイメントクラスパスに対してメソッドを実行する

source: Executing some method against the runtime classpath
ja_jp: ランタイムクラスパスに対してメソッドを実行する

source: Executing that will produce additional output lines like this:
ja_jp: これを実行すると、次のような追加の出力行が得られます。

source: Executing the native executable with `-XX:PrintFlags=` prints a list of flags that can be passed to native executables. For various levels of GC logging one may use:
ja_jp: `-XX:PrintFlags=` でネイティブ実行可能ファイルを実行すると、ネイティブ実行可能ファイルに渡すことができるフラグのリストが表示されます。 GCロギングのさまざまなレベルに対して、以下のフラグを使用できます:

source: Execution Model
ja_jp: 実行モデル

source: Execution model
ja_jp: 実行モデル

source: Execution model and Blocking processing
ja_jp: 実行モデルとブロッキング処理

source: Execution model, blocking, non-blocking
ja_jp: 実行モデル、ブロッキング、ノンブロッキング

source: Executions
ja_jp: 実行
